app/controllers/calendars_controller.rb

  def index
    @calendars = Calendar.all
---
SELECT "calendars".* FROM "calendars"

  def create
    @calendar = Calendar.new(calendar_params)

    respond_to do |format|
      if @calendar.save
---
INSERT INTO "calendars" ("title", "description", "start_time", "end_time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"

  def destroy
    @calendar.destroy!
---
DELETE FROM "calendars" WHERE "calendars"."id" = ?  [["id", 9]]

  def set_calendar
    @calendar = Calendar.find(params[:id])
---
SELECT "calendars".* FROM "calendars" WHERE "calendars"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]