app/controllers/pages_controller.rb

SELECT "calendars".* FROM "calendars" WHERE "calendars"."start_time" BETWEEN ? AND ?  [["start_time", "2024-10-28 00:00:00"], ["start_time", "2024-12-01 23:59:59.999999"]]
---
  def home
    @calendars = Calendar.where(start_time: Time.now.beginning_of_month.beginning_of_week..Time.now.end_of_month.end_of_week)